# AW23-P1-2-2.py
"""
题目2-2: 地球数据计算
姓名: 肖国涛
学号: 2313203025
专业: 计科专转本、大数据
"""

import math

radius = 6371 * 1000

# 1. 计算地球表面积 earth_area 平方米
# =====================================================
earth_area = 4 * math.pi * radius ** 2
print(f"{earth_area:.2f}")
# =====================================================

# 2. 计算地球体积 earth_volume 立方米
# =====================================================
earth_volume = (4 / 3) * math.pi * radius ** 3
print(f"{earth_volume:.2f}")
# =====================================================

# 3. 计算地球赤道周长 earth_perimeter 米
# =====================================================
earth_perimeter = 2 * math.pi * radius
print(f"{earth_perimeter:.2f}")
# =====================================================

# 4. 计算并输出绳子与地球之间的空隙大小，结果保留3位小数
# =====================================================
new_radius = earth_perimeter + 1
gap = new_radius / (2 * math.pi) - radius
print(f"{gap:.3f}")
# =====================================================

# 5. 判断老鼠是否可以从空隙中钻过
# =====================================================
mouse_diameter = 0.1  # 老鼠身体最粗处的直径（单位：米）

if gap > mouse_diameter:
    result = "老鼠可以从空隙中钻过"
else:
    result = "老鼠无法通过空隙"
print(result)
# =====================================================
